# დავალება №2

num1 = 888888888
num2 = 111111111
num3 = 1
print(num1 + num2 + num3)


# დავალება №3

X = 999999999999
Y = 1
print(X + Y)


# დავალება №4

length = 20
width = 10
print(length * width)


# დავალება №5

# მიმატება (+)
print(3847 + 6598)
print(12874 + 9876)
print(73245 + 54329)
print(980123 + 342876)
print(500500 + 499499)

# გამოკლება (-)
print(10000 - 4765)
print(8234 - 2897)
print(20000 - 18999)
print(999999 - 888888)
print(45321 - 23456)

# გამრავლება (*)
print(123 * 47)
print(584 * 2)
print(75 * 25)
print(902 * 18)
print(999 * 111)

# გაყოფა 1 (/)
print(8748 / 12)
print(9999 / 27)
print(56789 / 123)
print(10000 / 16)
print(1440 / 24)

# გაყოფა 2 (//)
print(9999 // 11)
print(100 // 10)
print(1123212 // 3)
print(20 // 4)
print(10000000002 // 3)