# task 1
# for loop არის ციკლი, რომელიც გვაძლევს საშუალებას გავიმეოროთ კოდი
# # იმდენჯერ, რამდენჯერაც საჭიროა ან იმდენჯერ, რამდენ ელემენტსაც ვუშვებთ.
# დანიშნულება:
# 1) იმეორებს მოქმედებებს
# 2) ამუშავებს მონაცემებს 
# 3) ამარტივებს კოდს და გვზოგავს დროს

# task 2
# while loop — ეს არის ციკლი, რომელიც იმუშავებს მანამ,
# სანამ მის მიერ მოცემული პირობა არ დაკმაყოფილდება
# გამოვიყენებთ როდესაც: 
# 1) როცა წინასწარ არ ვიცით რამდენჯერ უნდა შესრულდეს კოდი.
# 2) მაგალითად, სანამ მომხმარებელი არ შეიყვანს სწორ მონაცემს,
# 3) ან სანამ რაიმე პირობა არ შესრულდება.

# task 3
# indentation - გამეორება (ციკლი)

# task 4
# % ოპერატორს ვიყენებთ ორი რიცხვის გაყოფისას მიღებული ნაშთის ტერმინალში დაბეჭდისთვის.

# task 5
for i in range(0, 50, 2):
    print(i)

# task 6
for i in range(10):
    print("vakho")

# task 7
i = 0

while i < 67:
    print(i)
    i = i + 1

# task 8
num = 0

while count < 10:
    print("Vakho") 
    num = num + 1

# task 9
num1 = 22
num2 = input("write your favourite number: ")
while num1 < num2:
    print("hello world!")
    num2 += 1